docs/2025-12-16-construyendo-una-comunidad-de-programacion-etica-e-inclusiva.es.tex
% Created 2025-12-19 Fri 16:02
% Intended LaTeX compiler: pdflatex
\documentclass[letterpaper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
% Use fontspec with XeLaTeX
\usepackage{fontspec}
\usepackage{lmodern}
\usepackage{microtype}
\usepackage[T1]{fontenc}
\usepackage{amsmath, amssymb, amsthm}
\usepackage{graphicx}
\usepackage{xcolor}
\usepackage{hyperref}
\usepackage{booktabs}
\usepackage{enumitem}
\usepackage{geometry}
\usepackage{natbib}
\bibliographystyle{apalike}
\definecolor{softblue}{HTML}{304966}
\usepackage{orcidlink}
\hypersetup{colorlinks=true, linkcolor=softblue, citecolor=softblue, urlcolor=softblue}
\usepackage{minted}
\setminted{
fontsize=\footnotesize,
breaklines=true,
linenos=true,
frame=single
}
\geometry{margin=1in}
\input{~/.brain.d/latex/latex-macros.tex}
\author{Cristian D. Moreno - Kyonax\textasciitilde{}\orcidlink{0009-0006-4459-5538}\affiliation{Senior Full-Stack Engineer}}
\date{Dec 19, 2025}
\title{Construyendo una comunidad de programación ética e inclusiva\\\medskip
\large La visión de Cyber Code Syndicate (CCS)}
\hypersetup{
 pdfauthor={Cristian D. Moreno - Kyonax\textasciitilde{}\orcidlink{0009-0006-4459-5538}\affiliation{Senior Full-Stack Engineer}},
 pdftitle={Construyendo una comunidad de programación ética e inclusiva},
 pdfkeywords={software ético, educación, software libre, código abierto, comunidad, inclusión, desarrolladores, autonomía del usuario, transparencia, CCS, colaboración, accesibilidad, desarrollo responsable},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.34)},
 pdflang={English},
 colorlinks=true,
 linkcolor={cyan}
}\usepackage{biblatex}

\begin{document}

\maketitle
\begin{quote}
Copyright (C) 2025 Cristian D. Moreno - Kyonax. Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with the Invariant Sections being ``GNU Philosophy'', with no Front-Cover Texts, and no Back-Cover Texts.
\end{quote}

\begin{abstract}
\emph{El software ético es un pilar fundamental de una sociedad digital sana y confiable.} Defiende los derechos y las necesidades de las personas usuarias al garantizar la libertad de usar, estudiar, modificar y compartir software, al tiempo que protege la autonomía, la privacidad y la transparencia. Organizaciones influyentes como la \textbf{Free Software Foundation (FSF)} y la \textbf{Mozilla Foundation} han establecido principios éticos fundamentales que orientan el desarrollo tecnológico responsable. Compartimos muchos de estos valores, en particular el enfoque \textbf{centrado en las personas} que promueve \textbf{Mozilla}. Sin embargo, sostenemos que la verdadera \textbf{libertad del software} implica empoderar tanto a usuarios como a desarrolladores para que puedan elegir cómo implementar y distribuir software ético, ya sea mediante modelos \textbf{libres}, de \textbf{código abierto} o \textbf{propietarios}. Nuestra comunidad no impone una ideología rígida ni restringe la participación en función del licenciamiento. En su lugar, buscamos inspirar a través del ejemplo y confiar en que cada persona tome sus propias decisiones éticas.

\textbf{Cyber Code Syndicate (CCS)} es una comunidad colaborativa dedicada a la enseñanza del desarrollo de software y a la promoción de prácticas éticas. \emph{Nuestra misión principal es ayudar a las personas a aprender a programar, comprender la importancia del software ético y empoderar a todas las personas (especialmente a desarrolladores hispanohablantes) mediante recursos prácticos, eventos educativos, documentación y espacios de diálogo abierto.} CCS no es un movimiento ni una organización guiada por la política, sino una comunidad de programadores y aprendices que se apoyan mutuamente, construyen software útil y ético, y comparten el conocimiento de forma abierta. \textbf{CCS} da la bienvenida a todas las personas que valoran el aprendizaje, la colaboración y la creación de software que beneficie a la sociedad respetando la autonomía y la libertad de elección individual. \emph{Nuestro enfoque es fortalecer a la comunidad de desarrolladores de origen hispano, ofreciendo acceso amplio a la educación y fomentando la adopción de principios de software ético en todos los niveles de experiencia.}
\end{abstract}
\subsubsection*{Definición de términos clave}
\label{sec:org278846c}
\begin{itemize}
\item \emph{Software:} Programas o herramientas digitales que realizan tareas específicas en computadoras o dispositivos electrónicos.
\item \emph{Software ético:} Software diseñado para respetar la privacidad, la autonomía y el bienestar de las personas usuarias. Prioriza la transparencia, la seguridad y el uso responsable.
\item \emph{Free Software Foundation (FSF):} Organización sin ánimo de lucro dedicada a defender las libertades de los usuarios y a promover derechos relacionados con el uso, la modificación y la distribución del software.
\item \emph{Mozilla Foundation:} Organización sin ánimo de lucro enfocada en promover tecnología de código abierto, la salud de Internet, la transparencia y software centrado en las personas.
\item \emph{Software libre:} Software que ofrece la libertad de usar, estudiar, modificar y compartir sin restricciones, apoyando la autonomía y el aprendizaje.
\item \emph{Software de código abierto:} Software cuyo código fuente está disponible públicamente para ver, colaborar, mejorar y participar.
\item \emph{Software propietario:} Software que restringe las libertades de los usuarios limitando el acceso al código fuente y controlando el uso, la modificación y la distribución mediante licencias.
\item \emph{Código fuente:} Instrucciones legibles por personas que constituyen un programa. El acceso al código fuente permite aprender, auditar y modificar el software.
\item \emph{Licencia:} Reglas legales que definen cómo se puede usar, compartir y cambiar el software. Ejemplos incluyen la GPL (Software Libre) y la licencia MIT (Código Abierto).
\item \emph{Autonomía del usuario:} Principio según el cual las personas deben tener control total sobre el software que usan, pudiendo adaptarlo, rechazarlo o configurarlo según sus necesidades.
\item \emph{Transparencia:} Acceso claro y abierto a cómo funciona el software, sin código oculto ni comportamiento malicioso, y con documentación comprensible.
\item \emph{Privacidad:} Garantizar que los datos de las personas usuarias estén protegidos, se recolecten mínimamente y se gestionen con consentimiento informado.
\item \emph{Accesibilidad:} Asegurar que todas las personas, independientemente de su contexto o capacidad, puedan usar y beneficiarse de las herramientas de software.
\item \emph{Comunidad:} Grupo de personas que aprenden, comparten, colaboran y se apoyan mutuamente. En CCS nos enfocamos en la educación, el desarrollo ético y el apoyo, especialmente para desarrolladores hispanohablantes.
\item \emph{Cyber Code Syndicate (CCS):} Comunidad colaborativa que enseña desarrollo de software y promueve prácticas éticas centradas en las personas, empoderando especialmente a desarrolladores hispanohablantes mediante aprendizaje abierto, colaboración y libertad de elección.
\end{itemize}
