docs/2025-12-16-construyendo-una-comunidad-de-programacion-etica-e-inclusiva.es.tex
\section*{Introducción}
\label{sec:orgcf62ec6}
\emph{El progreso tecnológico debe servir a la humanidad, no controlarla.} Los derechos fundamentales para controlar, modificar y compartir software han sido moldeados por organizaciones como la \textbf{Free Software Foundation (FSF)} y la \textbf{Mozilla Foundation}. Estos grupos defienden la \textbf{autonomía del usuario}, la \textbf{transparencia}, la \textbf{privacidad} y el \textbf{acceso abierto} como pilares de una sociedad digital confiable.

Mientras la \textbf{Free Software Foundation (FSF)} defiende con firmeza las libertades del software mediante marcos de licenciamiento como el \textbf{copyleft}, diseñados para garantizar que el software y sus derivados se mantengan libres y accesibles, estos mismos mecanismos a veces pueden introducir fricciones prácticas. Para desarrolladores y organizaciones que operan en entornos \textbf{propietarios} o de \textbf{código mixto}, integrar ese software puede implicar restricciones legales o estructurales que complican la adopción gradual, la experimentación o el uso parcial. Con el tiempo, esta rigidez puede moldear percepciones y desalentar la participación, no por oposición a principios éticos, sino por preocupaciones sobre la flexibilidad y la integración, haciendo que el \textbf{software que respeta la libertad} parezca menos accesible para quienes lo encuentran por primera vez.

La \textbf{Mozilla Foundation} adopta un \emph{enfoque más centrado en las personas}, enfatizando la \textbf{transparencia}, la \textbf{privacidad} y la colaboración amplia sin exigir la adhesión estricta a los ideales del Software Libre. Aun así, ambas organizaciones han concentrado sus recursos y comunidades mayoritariamente en \textbf{audiencias de habla inglesa}, dejando a \textbf{desarrolladores hispanohablantes} con acceso limitado a documentación clave y a espacios de discusión ética relevantes.

\textbf{Cyber Code Syndicate (CCS)} fue creado para cerrar estas brechas, con el objetivo de hacer accesibles tanto el conocimiento técnico como el desarrollo de software ético a cualquier persona, sin importar su origen o experiencia. \textbf{CCS} enseña desarrollo de software y prácticas responsables a través de contenidos educativos, discusiones abiertas, proyectos comunitarios de \textbf{Software Libre y de Código Abierto}, mentoría y eventos públicos. Nuestra iniciativa pone un énfasis particular en apoyar a \textbf{desarrolladores hispanohablantes} y a \textbf{desarrolladores de origen hispano}, aunque permanece abierta y acogedora para todas las personas. En lugar de imponer un único marco de licenciamiento o ideológico, \textbf{CCS} fomenta el aprendizaje, la colaboración y el liderazgo con el ejemplo, permitiendo a quienes contribuyen comprender el \textbf{ecosistema de Software Libre y Código Abierto}, explorar distintas aproximaciones al \textbf{desarrollo ético} y tomar decisiones informadas sobre cómo debe usarse, adaptarse o integrarse el software que ayudan a crear. Priorizando la \textbf{autonomía}, la \textbf{transparencia} y el \textbf{diseño centrado en las personas} en nuestros propios proyectos, \textbf{CCS} demuestra cómo el software puede servir a las personas, dejando la adopción y la dirección en manos de su comunidad.
\section*{Nuestros Principios}
\label{sec:orgd2e351b}
\textbf{CCS} opera basándose en pautas éticas arraigadas en las filosofías de la \textbf{Free Software Foundation} y la \textbf{Mozilla Foundation}. Estas orientan nuestro enfoque para la enseñanza, el desarrollo y la colaboración, guiando un progreso tecnológico responsable e inclusivo.
\subsection*{Principios centrales}
\label{sec:org79f5abe}
\subsubsection*{\textbf{El software sirve a las personas}}
\label{sec:orgaae7309}
La tecnología \emph{(incluida la inteligencia artificial)} debe priorizar el bienestar humano. El software debe mejorar vidas, fomentar la creatividad y resolver problemas, \textbf{nunca manipular ni explotar a las personas usuarias}.
\subsubsection*{\textbf{Libertad para usar el software}}
\label{sec:org7a3eee5}
Todas las personas tienen derecho a ejecutar software para cualquier propósito, \textbf{sin discriminación por motivos individuales, grupales o de actividad}.
\subsubsection*{\textbf{Libertad para estudiar el software}}
\label{sec:org70fa70e}
El acceso al código fuente es esencial para el aprendizaje y la confianza. Las personas usuarias deben poder entender cómo funciona el software, respaldadas por \textbf{documentación clara y explicaciones transparentes}.
\subsubsection*{\textbf{Libertad para modificar el software}}
\label{sec:orgfd7d427}
Desarrolladores y usuarios deben poder adaptar el software, \textbf{cambiar su comportamiento} y mejorarlo según su contexto y objetivos.
\subsubsection*{\textbf{Libertad para compartir el software}}
\label{sec:orga512540}
\textbf{Compartir conocimiento fortalece las comunidades.} La redistribución de software original o modificado permite el aprendizaje, la colaboración y el progreso colectivo.
\subsubsection*{\textbf{Autonomía del usuario}}
\label{sec:org3a4c89c}
Las personas deben mantener \textbf{control total} sobre el software que usan. El software no debe imponer restricciones técnicas o legales que limiten la elección, coaccionen el comportamiento o impidan dejar de usarlo. \textbf{CCS rechaza prácticas de diseño adictivas y coercitivas que socavan la autonomía.}
\subsubsection*{\textbf{Transparencia y auditabilidad}}
\label{sec:org4bb8b31}
\textbf{El software ético debe ser susceptible de inspección.} La funcionalidad oculta o maliciosa contradice la confianza y la rendición de cuentas.
\subsubsection*{\textbf{Oposición a la vigilancia}}
\label{sec:org8526ccd}
\textbf{CCS rechaza software diseñado para o que habilite el espionaje, la recolección explotativa de datos o la vigilancia sin control.}
\subsubsection*{\textbf{Privacidad por defecto}}
\label{sec:orgecc13c8}
El software ético \textbf{minimiza la recolección de datos}, requiere \textbf{consentimiento informado} y garantiza el \textbf{control del usuario} sobre sus datos personales.
\subsubsection*{\textbf{Seguridad y confianza}}
\label{sec:org1c5af7d}
\textbf{El software seguro es una responsabilidad ética.} Las y los desarrolladores deben proteger a las personas usuarias contra el abuso, la explotación y riesgos innecesarios.
\subsubsection*{\textbf{Accesibilidad e inclusión}}
\label{sec:org972ecc1}
El software ético debe ser usable y comprensible en contextos económicos, técnicos y culturales diversos. \textbf{CCS prioriza el acceso a conocimientos y herramientas para todos los niveles de habilidad.}
\subsubsection*{\textbf{Interoperabilidad}}
\label{sec:org43ea110}
El software debe cooperar con otros sistemas y herramientas. Evitar el bloqueo tecnológico respalda la \textbf{libertad de elección} y la sostenibilidad.
\subsubsection*{\textbf{Libertad de elección}}
\label{sec:org8f34a04}
Usuarios y contribuyentes deben ser libres de seleccionar sus herramientas, entornos y flujos de trabajo. \textbf{CCS desalienta ecosistemas cerrados y estándares obligatorios que limiten la experimentación o el aprendizaje.}
\subsubsection*{\textbf{Desarrollo abierto como medio, no como dogma}}
\label{sec:org31e23f6}
\textbf{El Software Libre y el Código Abierto son instrumentos, no fines ideológicos.} El objetivo es un ecosistema digital saludable centrado en las personas.
\subsubsection*{\textbf{Rechazo del diseño manipulador}}
\label{sec:orgbab5a0d}
\textbf{CCS no apoya patrones oscuros ni diseños explotativos.} El desarrollo ético respeta la dignidad, la agencia y la toma de decisiones informada.
\subsubsection*{\textbf{Gobernanza responsable}}
\label{sec:org97c0f0a}
\textbf{CCS es una comunidad abierta.} Las decisiones son transparentes, colaborativas y guiadas por la responsabilidad social.
\subsection*{La ética como guía, no como imposición}
\label{sec:orgfeec5b5}
\textbf{CCS fomenta software que siga estos principios, pero no los impone como restricciones rígidas} a contribuyentes o usuarios finales. Las personas y las organizaciones siguen siendo \textbf{libres de modificar, ampliar, redistribuir o integrar} proyectos de CCS según sus propios enfoques. Nuestro papel es \textbf{liderar con el ejemplo, ofreciendo orientación en lugar de exigir cumplimiento.}

Esto se alinea con la \textbf{filosofía de Mozilla} de promover una ética centrada en las personas mediante la colaboración y el ejemplo positivo, en lugar de un dogma.
